// pages/classroom/course/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    courses: ['全部', '异地恋', '形象提升', '相亲技巧', '关系管理', '舔狗的自我修养', '海王养成记'], 
    article: [
      {
        title:'【异地恋7点方法】异地恋也可以爱的轰轰烈烈',
        time:'2020-01-03 04:57'
      },
      {
        title:'这五点学好，异地恋不用发愁',
        time:'2019-12-27 20:45'
      },
      {
        title:'教你如何在异地恋中去维系你的爱情',
        time:'2020-01-19 10:24'
      },
      {
        title:'情感干货 | 破碎的爱情及异地恋成功秘籍',
        time:'2020-01-21 15:45'
      },
      {
        title:'异地恋3个最需注意的事，一定要知道',
        time:'2019-12-09 21:14'
      },
      {
        title:'三步妙招挽回异地分手，找回真爱就靠它',
        time:'2019-12-28 08:29'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})